# include <stdio.h>
// 整型 int 4个字节
// (1)具有相同的数据类型 (2)使用过程中需要保存数据 (3)适合才是最好的
// 表达式 类型说明符 数组名 [常量表达式]
// int main()
// {
//     int a[5] = {1,2,3,4,5}; 
//     printf("a[0] adress is %p\n", &a[1]);
//     return 0;
// }

// 打印数组里的每一个元素, 数组再传递时，元素个数传递不过去
void print(int a[],int len)
{
    int i; 
    for(i = 0;i<len;i++){
        printf("a[%d] = %3d\n",i,a[i]);
    }
    a[4]=20; //在子函数中修改数组元素
    printf("\n");
}

// 数组越界问题
// 一维数组的传递
int main(){
    int j = 10;
    int a[5] = {1,2,3,4,5}; // 定义数组时，数组长度必须固定
    int i = 3;
    // a[5] = 20; // 访问越界；访问了不属于自己的空间
    // a[6] = 21;
    // a[7] = 22; // 访问越界会造成数据异常
    // printf("j=%d\n",j); // j 变成22
    print(a,5);
    printf("a[4]=%d\n",a[4]); // a[4]发生改变
    return 0;
}

